<?php
$a = 10;
$b = 3;
$c = $a % $b;
echo '1. ', $c;
///////////////////////////////////////
echo '<br>';
$a = 15;
$b = 7;
if ($a % $b == 0) {
    echo '2. Делится без остатка. Ответ: ', $a / $b;
} else {
    echo '2. Делится с остатком. Остаток: ', $a % $b;
}
echo '<br>';
///////////////////////////////////////////
$st = pow(2, 10);
echo '3.', $st;
echo '<br>';
///////////////////////////////////////////////
$a = sqrt(245);
echo '4.', $a;
echo '<br>';
////////////////////////////////////
$a = 0;
$arr = [4, 2, 5, 19, 13, 0, 10,];
foreach ($arr as $key => $value) {
    $a = $a + $value * $value;
}
$a = sqrt($a);
echo '5.', $a;
echo '<br>';
///////////////////////////////
echo '<br>';
$a = sqrt(379);
echo $a, '<br>';
echo '6. ', round($a), ' ', round($a,2), ' ', round($a,1);
echo '<br>';
////////////////////////////////////////
echo '7.';
$a = sqrt(587);
$arr = [
    'floor' => floor($a),
    'ceil' => ceil($a),
];
var_dump($arr);
echo '<br>';
////////////////////////////////////////////////////
echo '8.';
echo min(4, -2, 5, 19, -130, 0, 10), ' <br>';
echo max(4, -2, 5, 19, -130, 0, 10), ' <br>';
///////////////////////////////////////////////////////////
echo '<br>';
echo '9.', mt_rand(1, 100);
echo '<br>';
echo '10. ';
$arr = [];
$i = 0;
While ($i <= 10) {
    $arr[] = mt_rand(1, 100);
    $i++;
}
var_dump($arr);
echo '<br>';
//////////////////////////////////////////
$a = 5;
$b = 12;
$c = abs($a - $b);
echo '11. ', $c;
echo '<br>';
///////////////////////////////////////////
echo '13.';
$a = 777;
$arr = [];
$i = 1;
while ($i <= $a) {
    if ($a % $i == 0) {
        $arr[] = $i;
    }
    $i++;
}
var_dump($arr);
echo '<br>';
/////////////////////////////////////////////
$a = 0;
$i = 1;
$b = 0;
$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10,];
foreach ($arr as $key => $value) {
    $a += $value;
    if ($a > 10) {
       break;
    }
    $i++;
}
echo '14. ', $i;

$arr1 = [1, 2, -3, 4, -5, ];
foreach ($arr1 as $key => $value) {
    if ($value < 0) {
        $arr1[$key] = abs($value);
    }
}
var_dump($arr1);




