<?php
$a = 1;
if ($a == 0) {
    echo '1. Верно <br>';
} else {
    echo '1. Не верно <br>';
}
////////////////////
$a = 1;
if ($a > 0) {
    echo '2. Верно <br>';
} else {
    echo '2. Не верно <br>';
}
////////////////////
$a = 1;
if ($a < 0) {
    echo '3. Верно <br>';
} else {
    echo '3. Не верно <br>';
}
////////////////////
$a = 1;
if ($a >= 0) {
    echo '4. Верно <br>';
} else {
    echo '4. Не верно <br>';
}
////////////////////
$a = 1;
if ($a == 0) {
    echo '5. Не Верно <br>';
} else {
    echo '5.  Верно <br>';
}
////////////////////
$a = 1;
if ($a != 0) {
    echo '6.  Верно <br>';
} else {
    echo '6. Не верно <br>';
}
////////////////////
$a = 'test';
if ($a == 'test') {
    echo '7. Верно <br>';
} else {
    echo '7. Не верно <br>';
}
///////////////////////////////
$a = '1';
if (gettype($a) == 'string' && $a == 1) {
    echo '8.  Верно <br>';
} else {
    echo '8.  Не верно <br>';
}
////////////////////////
$a = '';
if (!empty($a)) {
    echo '9. Переменная пустая <br>';
} else {
    echo '9. Переменная не пустая <br>';
}
//////////////////////////////////////
$a = '2';
if (!empty($a)) {
    echo '10. Верно <br>';
} else {
    echo '10. Не верно <br>';
}
//////////////////////////////////////////
$var = true;
if ($var) {
    echo '13. Верно <br>';
} else {
    echo '13. Не верно <br>';
}
$var > 0 ? $b = 'Верно' : $b = 'Не верно';
echo $b;
echo 'Число ' . ($var ? 'Верно' : 'Не верно');
/////////////////////////////////////////////
$var = false;
if (!$var) {
    echo '14.  Верно <br>';
} else {
    echo '14. Не Верно <br>';
}
////////////////////////////////////////////////
$a = -3;
if ($a > 0 && $a < 5) {
    echo '15.  Верно <br>';
} else {
    echo '15. Не верно <br>';
}
//////////////////////////////////////////////
$a = -1;
if ($a == 0 || $a == 2) {
    echo '16. ' . $a = $a + 7 . ' <br>';
} else {
    echo '16. ' . $a = $a / 10 . '<br>';
}
/////////////////////////////////////////////////////////
$a = 3;
$b = 5;
if ($a <= 1 && $b >= 3) {
    echo '17. ' . $a = $a + $b . ' <br>';
} else {
    echo '17. ' . $a = $a - $b . '<br>';
}
////////////////////////////////////////////////////////////
$a = 3;
$b = 5;
if (($a > 2 && $a < 11) || ($b >= 6 && $b < 14)) {
    echo '18. Верно <br>';
} else {
    echo '18. Не верно <br>';
}
////////////////////////////////////////////////////////////
$num = 4;
switch ($num) {
    case 1:
        $result = 'Зима';
        break;
    case 2:
        $result = 'Весна';
        break;
    case 3:
        $result = 'Лето';
        break;
    case 4:
        $result = 'Осень';
        break;
}
echo '19. ' . $result . ' <br>';
///////////////////////////////////////////////////////////////////
$day = 30;
if ($day < 11) {
    echo '20. 1<br>';
} elseif ($day > 10 && $day < 21) {
    echo '20. 2<br>';
} elseif ($day > 20 && $day < 31) {
    echo '20. 3<br>';
}
///////////////////////////////////////////////////////////////////
$month = 1;
if ($month == 1 || $month == 2 || $month == 12) {
    echo '21. Зима<br>';
} elseif ($month == 3 || $month == 4 || $month == 5) {
    echo '21. Весна<br>';
} elseif ($month == 6 || $month == 7 || $month == 8) {
    echo '21. Лето<br>';
} elseif ($month == 9 || $month == 10 || $month == 11) {
    echo '21. Осень<br>';
}
/////////////////////////////////////////////////////////////////////////
$a = '796976';
if ($a[0] + $a[1] + $a[2] == $a[3] + $a[4] + $a[5]) {
    echo '26. Верно <br>';
} else {
    echo '26. Не верно <br>';
}
$year = 1700;
if (($year % 4 == 0) && ($year % 100 != 0) || ($year % 400 == 0)) {
    echo '22. Год високосный <br>';
} else {
    echo '22. Год не високосный';
}